perf/put_rates_gradual_demand_peak.yaml
config:
  processor: "./payload_generators.js"
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 200

  phases:
    - name: Warm-up
      duration: 20
      arrivalRate: 5

    - name: Normal trading
      duration: 60
      arrivalRate: 50

    # En caso de modificarse el script, también modificar VOLATILITY_WINDOW en payload_generators.js
    - name: Volatility shock (por X anuncio economico)
      duration: 120
      arrivalRate: 50
      rampTo: 600

    # El mercado "se calma" y volvemos a 50 req/s como antes del pico de uso.
    - name: Recovery
      duration: 60
      arrivalRate: 600
      rampTo: 50

    - name: Cooldown
      duration: 30
      arrivalRate: 10

scenarios:
  - name: Update rate under volatility (PUT /rates)
    flow:
      - function: "generateVolatilityPayload"
      - put:
          url: '/rates'
          json:
            baseCurrency: "{{ baseCurrency }}"
            counterCurrency: "{{ counterCurrency }}"
            rate: "{{ rate }}"
          expect:
            - statusCode: 200
            - contentType: json